run/CHT/chtMultiRegionFoam/system/blockMeshDict
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Copyright held by the original author
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    ( 0 -1.0  2.25) ( 0 -0.5  2.25) ( 0  0.5  2.25) ( 0  1.0  2.25) (40 -1.0  2.25) (40 -0.5  2.25) (40  0.5  2.25) (40  1.0  2.25)
    ( 0 -1.0  1.25) ( 0 -0.5  1.25) ( 0  0.5  1.25) ( 0  1.0  1.25) (40 -1.0  1.25) (40 -0.5  1.25) (40  0.5  1.25) (40  1.0  1.25)
    ( 0 -1.0  0.25) ( 0 -0.5  0.25) ( 0  0.5  0.25) ( 0  1.0  0.25) (40 -1.0  0.25) (40 -0.5  0.25) (40  0.5  0.25) (40  1.0  0.25)
    ( 0 -1.0  0.05) ( 0 -0.5  0.05) ( 0  0.5  0.05) ( 0  1.0  0.05) (40 -1.0  0.05) (40 -0.5  0.05) (40  0.5  0.05) (40  1.0  0.05)
    ( 0 -1.0  0.03) ( 0 -0.5  0.03) ( 0  0.5  0.03) ( 0  1.0  0.03) (40 -1.0  0.03) (40 -0.5  0.03) (40  0.5  0.03) (40  1.0  0.03)
    ( 0 -1.0  0.01) ( 0 -0.5  0.01) ( 0  0.5  0.01) ( 0  1.0  0.01) (40 -1.0  0.01) (40 -0.5  0.01) (40  0.5  0.01) (40  1.0  0.01)
    ( 0 -1.0 -0.01) ( 0 -0.5 -0.01) ( 0  0.5 -0.01) ( 0  1.0 -0.01) (40 -1.0 -0.01) (40 -0.5 -0.01) (40  0.5 -0.01) (40  1.0 -0.01)
    ( 0 -1.0 -0.03) ( 0 -0.5 -0.03) ( 0  0.5 -0.03) ( 0  1.0 -0.03) (40 -1.0 -0.03) (40 -0.5 -0.03) (40  0.5 -0.03) (40  1.0 -0.03)
    ( 0 -1.0 -0.05) ( 0 -0.5 -0.05) ( 0  0.5 -0.05) ( 0  1.0 -0.05) (40 -1.0 -0.05) (40 -0.5 -0.05) (40  0.5 -0.05) (40  1.0 -0.05)
    ( 0 -1.0 -0.25) ( 0 -0.5 -0.25) ( 0  0.5 -0.25) ( 0  1.0 -0.25) (40 -1.0 -0.25) (40 -0.5 -0.25) (40  0.5 -0.25) (40  1.0 -0.25)
    ( 0 -1.0 -1.25) ( 0 -0.5 -1.25) ( 0  0.5 -1.25) ( 0  1.0 -1.25) (40 -1.0 -1.25) (40 -0.5 -1.25) (40  0.5 -1.25) (40  1.0 -1.25)
    ( 0 -1.0 -2.25) ( 0 -0.5 -2.25) ( 0  0.5 -2.25) ( 0  1.0 -2.25) (40 -1.0 -2.25) (40 -0.5 -2.25) (40  0.5 -2.25) (40  1.0 -2.25)
);

blocks
(
// Solid
    hex ( 1  2  6  5  9 10 14 13) solid (10 40  5) simpleGrading (1 1 1)

    hex ( 0  1  5  4  8  9 13 12) solid ( 5 40  5) simpleGrading (1 1 1)
    hex ( 2  3  7  6 10 11 15 14) solid ( 5 40  5) simpleGrading (1 1 1)

    hex ( 8  9 13 12 16 17 21 20) solid ( 5 40 10) simpleGrading (1 1 1)
    hex (10 11 15 14 18 19 23 22) solid ( 5 40 10) simpleGrading (1 1 1)


    hex (81 82 86 85 89 90 94 93) solid (10 40  5) simpleGrading (1 1 1)

    hex (82 83 87 86 90 91 95 94) solid ( 5 40  5) simpleGrading (1 1 1)
    hex (80 81 85 84 88 89 93 92) solid ( 5 40  5) simpleGrading (1 1 1)

    hex (72 73 77 76 80 81 85 84) solid ( 5 40 10) simpleGrading (1 1 1)
    hex (74 75 79 78 82 83 87 86) solid ( 5 40 10) simpleGrading (1 1 1)

// Hot
    hex ( 9 10 14 13 17 18 22 21) hot          (10 40 10) simpleGrading (1 1 1)

    hex (17 18 22 21 25 26 30 29) solid          (10 40  5) simpleGrading (1 1 1)
    hex (25 26 30 29 33 34 38 37) solid          (10 40  5) simpleGrading (1 1 1)
    hex (33 34 38 37 41 42 46 45) solid          (10 40  5) simpleGrading (1 1 1)

    hex (16 17 21 20 24 25 29 28) solid          ( 5 40  5) simpleGrading (1 1 1)
    hex (24 25 29 28 32 33 37 36) solid          ( 5 40  5) simpleGrading (1 1 1)
    hex (32 33 37 36 40 41 45 44) solid          ( 5 40  5) simpleGrading (1 1 1)

    hex (18 19 23 22 26 27 31 30) solid          ( 5 40  5) simpleGrading (1 1 1)
    hex (26 27 31 30 34 35 39 38) solid          ( 5 40  5) simpleGrading (1 1 1)
    hex (34 35 39 38 42 43 47 46) solid          ( 5 40  5) simpleGrading (1 1 1)

// Solid
    hex (41 42 46 45 49 50 54 53) solid  (10 40  5) simpleGrading (1 1 1)

    hex (40 41 45 44 48 49 53 52) solid  ( 5 40  5) simpleGrading (1 1 1)

    hex (42 43 47 46 50 51 55 54) solid  ( 5 40  5) simpleGrading (1 1 1)

// Cold
    hex (49 50 54 53 57 58 62 61) solid         (10 40  5) simpleGrading (1 1 1)
    hex (57 58 62 61 65 66 70 69) solid         (10 40  5) simpleGrading (1 1 1)
    hex (65 66 70 69 73 74 78 77) solid         (10 40  5) simpleGrading (1 1 1)

    hex (73 74 78 77 81 82 86 85) cold         (10 40 10) simpleGrading (1 1 1)

    hex (48 49 53 52 56 57 61 60) solid         ( 5 40  5) simpleGrading (1 1 1)
    hex (56 57 61 60 64 65 69 68) solid         ( 5 40  5) simpleGrading (1 1 1)
    hex (64 65 69 68 72 73 77 76) solid         ( 5 40  5) simpleGrading (1 1 1)

    hex (50 51 55 54 58 59 63 62) solid         ( 5 40  5) simpleGrading (1 1 1)
    hex (58 59 63 62 66 67 71 70) solid         ( 5 40  5) simpleGrading (1 1 1)
    hex (66 67 71 70 74 75 79 78) solid         ( 5 40  5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
        );
    }

    sides
    {
        type patch;
        faces
        (
            ( 0  4 12  8)
            ( 8 12 20 16)
            ( 3  7 15 11)
            (11 15 23 19)

            ( 0  1  9  8)
            ( 8  9 17 16)
            ( 4  5 13 12)
            (12 13 21 20)

            ( 1  2 10  9)
            ( 5  6 14 13)

            ( 2  3 11 10)
            (10 11 19 18)
            ( 6  7 15 14)
            (14 15 23 22)


            (88 92 84 80)
            (80 84 76 72)
            (91 95 87 83)
            (83 87 79 75)

            (89 90 82 81)
            (93 94 86 85)

            (88 89 81 80)
            (80 81 73 72)
            (92 93 85 84)
            (84 85 77 76)

            (90 91 83 82)
            (82 83 75 74)
            (94 95 87 86)
            (86 87 79 78)

            (40 44 52 48)
            (40 41 49 48)
            (41 42 50 49)
            (42 43 51 50)
            (43 47 55 51)
            (44 45 53 52)
            (45 46 54 53)
            (46 47 55 54)
        );
    }

// Hot
    hotInlet
    {
        type patch;
        faces
        (
            ( 9 10 18 17)
        );
    }

    hotOutlet
    {
        type patch;
        faces
        (
            (13 14 22 21)
        );
    }

    hotSides
    {
        type patch;
        faces
        (
            (16 20 28 24)
            (16 17 25 24)
            (17 18 26 25)
            (18 19 27 26)
            (19 23 31 27)
            (20 21 29 28)
            (21 22 30 29)
            (22 23 31 30)

            (24 28 36 32)
            (24 25 33 32)
            (25 26 34 33)
            (26 27 35 34)
            (27 31 39 35)
            (28 29 37 36)
            (29 30 38 37)
            (30 31 39 38)

            (32 36 44 40)
            (32 33 41 40)
            (33 34 42 41)
            (34 35 43 42)
            (35 39 47 43)
            (36 37 45 44)
            (37 38 46 45)
            (38 39 47 46)
        );
    }

// Cold
    coldSides
    {
        type patch;
        faces
        (
            (48 52 60 56)
            (48 49 57 56)
            (49 50 58 57)
            (50 51 59 58)
            (51 55 63 59)
            (52 53 61 60)
            (53 54 62 61)
            (54 55 63 62)

            (56 60 68 64)
            (56 57 65 64)
            (57 58 66 65)
            (58 59 67 66)
            (59 63 71 67)
            (60 61 69 68)
            (61 62 70 69)
            (62 63 71 70)

            (64 68 76 72)
            (64 65 73 72)
            (65 66 74 73)
            (66 67 75 74)
            (67 71 79 75)
            (68 69 77 76)
            (69 70 78 77)
            (70 71 79 78)
        );
    }

    coldOutlet
    {
        type patch;
        faces
        (
            (73 74 82 81)
        );
    }

    coldInlet
    {
        type patch;
        faces
        (
            (77 78 86 85)
        );
    }

// Bottom
    bottom
    {
        type patch;
        faces
        (
            (88 89 93 92)
            (89 90 94 93)
            (90 91 95 94)
        );
    }
);

// ************************************************************************* //

