run/CHT/chtMultiRegionFoam/constant/hot/phaseProperties
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Copyright held by the original author
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type          singlePhaseSystem;

phases (hot);

hot
{
    type            purePhaseModel;
}

// Minimum allowable pressure
pMin            10000;

// ************************************************************************* //
