run/CHT/chtMultiRegionFoam/0.orig/k
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Copyright held by the original author
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "20";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -3 -1 0 0 0];

internalField   uniform 1;

boundaryField
{
    ".*"
    {
        type               calculated;
        value              $internalField;
    }

//    hotInlet
//    {
//        type         fixedValue;
//        //value        uniform 0.0692;
//        value        uniform 1e-15;    //disallow outward diffusion at inlet
//                                       // value 0 causes harmonic averaging FPE
//    }
//
//    coldInlet
//    {
//        type         fixedValue;
//        //value        uniform 0.432;
//        value        uniform 1e-15;    //disallow outward diffusion at inlet
//                                       // value 0 causes harmonic averaging FPE
//    }
}


// ************************************************************************* //
