run/CHT/chtMultiRegionFoam/system/fvSchemes
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Copyright held by the original author
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                 none;
    div(rhoCpPhi,T)         Gauss limitedLinear 1;
}

laplacianSchemes
{
    default              none;
    laplacian(k,T)       Gauss harmonic corrected;
}

interpolationSchemes
{
    default         harmonic;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    T;
}


// ************************************************************************* //
