run/CHT/chtMultiRegionFoam/system/cold/fvSolution
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Copyright held by the original author
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       2e-09;
            relTol          0;
            smoother        DIC;
            nPreSweeps      1;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration on;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
        tolerance       1e-10;
        relTol          0;
        maxIter         100;
    }

    "(e|h).*"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-11;
        relTol           0;
    }

    "U.*"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-9;
        relTol           0;
    }
}

PIMPLE
{
    momentumPredictor no;

    nOuterCorrectors 1;
    nCorrectors      3;
    nNonOrthogonalCorrectors 0;

    consistent    true;
}

relaxationFactors
{
    fields
    {
         p_rgh         0.3;
    }

    equations
    {
         "U.*"         0.7;
    }
}

// ************************************************************************* //
